'''
【程序1】
题目：古典问题：有一对兔子，从出生后第3个月起每个月都生一对兔子，小兔子长到第三个月后每个月又生一对兔子，假如兔子都不死，问每个月的兔子总数为多少？
1.程序分析： 兔子的规律为数列1,1,2,3,5,8,13,21....
2,2,4,6,10,16,26,计算可得兔子数应该是斐波那契数列的两倍
'''
# 简单递归太慢，有重复计算过程，正好第n项满足不重复，可哈希，直接作为字典键，存储对应的项
fib = {1: 1, 2: 1}
def Fib(n:int):
    if n <= 0:
        raise ValueError("月份必须大于0！")
    if n in fib:
        return fib[n]
    res = Fib(n - 1) + Fib(n - 2)
    fib[n] = res
    return res

print("前100个月的兔子总数：")
for i in range(1,101):
    print(2*Fib(i), end="只 ")
    if i%10 == 0:
        print("\n")

